app/controllers/books_controller.rb

  def create
  	book = Book.new(book_params)
  	if book.save
---
INSERT INTO "books" ("title", "opinion", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "タイトル"], ["opinion", "こんにちは"], ["created_at", "2018-06-27 06:35:01.140923"], ["updated_at", "2018-06-27 06:35:01.140923"], ["user_id", 1]]

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "opinion" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "タイトル１"], ["opinion", "こんにちは１"], ["updated_at", "2018-06-27 06:36:12.286878"], ["id", 1]]