app/controllers/users_controller.rb

  def update
  	@user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "543577fe15801576df034adf32166eb102e657835242499253fbb5033e31"], ["introduction", "こんにちは"], ["updated_at", "2018-06-27 06:35:35.700110"], ["id", 1]]